In [1]:
#Imports
#standard ds libraries
import pandas as pd
import numpy as np

# my acquire and prepare file
import acquire
import prepare

#env file to import datasets
import env

### 1. Attendance Data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [2]:
DB_URL = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/tidy_data'

In [3]:
attendance = pd.read_sql('SELECT * FROM attendance', DB_URL)
attendance

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
#renaming student columns
attendance.rename(columns = {'Unnamed: 0':'student'}, inplace = True)

In [5]:
#melting down
attendance = attendance.melt(id_vars = 'student',
                  var_name = 'date',
                  value_name = 'attendance')

attendance

   student        date attendance
0    Sally  2018-01-01          P
1     Jane  2018-01-01          A
2    Billy  2018-01-01          A
3     John  2018-01-01          P
4    Sally  2018-01-02          T
5     Jane  2018-01-02          P
6    Billy  2018-01-02          T
7     John  2018-01-02          T
8    Sally  2018-01-03          T
9     Jane  2018-01-03          T
10   Billy  2018-01-03          A
11    John  2018-01-03          H
12   Sally  2018-01-04          H
13    Jane  2018-01-04          T
14   Billy  2018-01-04          A
15    John  2018-01-04          P
16   Sally  2018-01-05          P
17    Jane  2018-01-05          T
18   Billy  2018-01-05          H
19    John  2018-01-05          P
20   Sally  2018-01-06          A
21    Jane  2018-01-06          T
22   Billy  2018-01-06          T
23    John  2018-01-06          T
24   Sally  2018-01-07          T
25    Jane  2018-01-07          A
26   Billy  2018-01-07          P
27    John  2018-01-07          P
28   Sally  2018-01-08          T
29    Jane  2018-01-08          T
30   Billy  2018-01-08          T
31    John  2018-01-08          P

In [6]:
#Rename attendance variables
attendance['attendance'] = attendance['attendance'].replace({'P':1, 'A':0, 'T':0.9, 'H':0.5})
attendance
#Class example using map
#attendance.attendance = attendance.attendance.map({'P': 1, 'H': 0.5, 'A': 0, 'T': 0.9})

   student        date  attendance
0    Sally  2018-01-01         1.0
1     Jane  2018-01-01         0.0
2    Billy  2018-01-01         0.0
3     John  2018-01-01         1.0
4    Sally  2018-01-02         0.9
5     Jane  2018-01-02         1.0
6    Billy  2018-01-02         0.9
7     John  2018-01-02         0.9
8    Sally  2018-01-03         0.9
9     Jane  2018-01-03         0.9
10   Billy  2018-01-03         0.0
11    John  2018-01-03         0.5
12   Sally  2018-01-04         0.5
13    Jane  2018-01-04         0.9
14   Billy  2018-01-04         0.0
15    John  2018-01-04         1.0
16   Sally  2018-01-05         1.0
17    Jane  2018-01-05         0.9
18   Billy  2018-01-05         0.5
19    John  2018-01-05         1.0
20   Sally  2018-01-06         0.0
21    Jane  2018-01-06         0.9
22   Billy  2018-01-06         0.9
23    John  2018-01-06         0.9
24   Sally  2018-01-07         0.9
25    Jane  2018-01-07         0.0
26   Billy  2018-01-07         1.0
27    John  2018-01-07         1.0
28   Sally  2018-01-08         0.9
29    Jane  2018-01-08         0.9
30   Billy  2018-01-08         0.9
31    John  2018-01-08         1.0

In [7]:
attendance.groupby('student').mean()

         attendance
student
Billy        0.5250
Jane         0.6875
John         0.9125
Sally        0.7625

### 2. Coffee Levels
Read the coffee_levels table.
Transform the data so that each carafe is in it's own column.
Is this the best shape for the data?

In [8]:
#a. read the coffee level tables
coffee_levels = pd.read_sql('SELECT * FROM coffee_levels', DB_URL)
coffee_levels

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [9]:
#b. Transform the data so that each carafe is in it's own column.
coffee_levels = coffee_levels.pivot(index='hour', columns='coffee_carafe', values= 'coffee_amount').reset_index().rename_axis(None, axis=1)
coffee_levels

   hour         x         y         z
0     8  0.816164  0.189297  0.999264
1     9  0.451018  0.521502  0.915990
2    10  0.843279  0.023163  0.144928
3    11  0.335533  0.235529  0.311495
4    12  0.898291  0.017009  0.771947
5    13  0.310711  0.997464  0.398520
6    14  0.507288  0.058361  0.864464
7    15  0.215043  0.144644  0.436364
8    16  0.183891  0.544676  0.280621
9    17  0.391560  0.594126  0.436677

In [10]:
#renaming columns
coffee_levels.columns = ['hour', 'carafe_x', 'carafe_y', 'carafe_z']
coffee_levels

   hour  carafe_x  carafe_y  carafe_z
0     8  0.816164  0.189297  0.999264
1     9  0.451018  0.521502  0.915990
2    10  0.843279  0.023163  0.144928
3    11  0.335533  0.235529  0.311495
4    12  0.898291  0.017009  0.771947
5    13  0.310711  0.997464  0.398520
6    14  0.507288  0.058361  0.864464
7    15  0.215043  0.144644  0.436364
8    16  0.183891  0.544676  0.280621
9    17  0.391560  0.594126  0.436677

In [12]:
#c is this the best shape for the data?
#The original is the best for machine learning (each variable is its own column, each row is a unique observation)

### 3. Cake recipes

In [11]:
# a. Read the cake_recipes table. This data set contains cake tastiness scores 
# for combinations of different recipes, oven rack positions, and oven temperatures.
cake_recipes = pd.read_sql('SELECT * FROM cake_recipes', DB_URL)
cake_recipes

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [12]:
#b. Tidy the data as necessary.
cake_melt= cake_recipes.melt(id_vars = 'recipe:position',
                  var_name = 'temperature', value_name = 'score')

In [13]:
cake_melt.head()

  recipe:position temperature      score
0        a:bottom         225  61.738655
1           a:top         225  51.709751
2        b:bottom         225  57.095320
3           b:top         225  82.455004
4        c:bottom         225  96.470207

In [14]:
#renaming columns
cake_melt.rename(columns = {'recipe:position':'recipe_position'}, inplace = True)
cake_melt.head()

  recipe_position temperature      score
0        a:bottom         225  61.738655
1           a:top         225  51.709751
2        b:bottom         225  57.095320
3           b:top         225  82.455004
4        c:bottom         225  96.470207

In [15]:
#Splitting recipe and position
recipe_position_df = cake_melt.recipe_position.str.split(':', expand=True)
recipe_position_df.columns = ['recipe', 'rack position']
recipe_position_df.head()

  recipe rack position
0      a        bottom
1      a           top
2      b        bottom
3      b           top
4      c        bottom

In [34]:
#adding back to df
cake_recipes_2 = pd.concat([cake_melt, recipe_position_df], axis=1).drop(columns='recipe_position')
cake_recipes_2.head()

  temperature      score recipe rack position
0         225  61.738655      a        bottom
1         225  51.709751      a           top
2         225  57.095320      b        bottom
3         225  82.455004      b           top
4         225  96.470207      c        bottom

In [43]:
# c. Which recipe, on average, is the best? recipe b
cake_recipes_2.groupby('recipe').mean().idxmax() #idx max shows where it holds the value

score    b
dtype: object

In [44]:
#d. Which oven temperature, on average, produces the best results? 
#275
cake_recipes_2.groupby('temperature').mean().idxmax()

score    275
dtype: object

In [50]:
# e. Which combination of recipe, rack position, and temperature gives the best result? 
# recipe b, bottom rack, 300 degrees
cake_recipes_2.sort_values(by = 'score', ascending = False).head(1)

   temperature      score recipe rack position
26         300  99.248541      b        bottom

In [55]:
#Class solution using groupby recipe
cake_recipes_2.groupby(['recipe', 'rack position', 'temperature']).mean().idxmax()

score    (b, bottom, 300)
dtype: object